# HasValidConfiguration Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..HasValidConfiguration Method
FabricationConfiguration Class See Also
---
Checks whether a valid fabrication configuration has been set for the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool HasValidConfiguration()
```

Visual Basic
---
```text
Public Function HasValidConfiguration As Boolean
```

Visual C++
---
```text
public:
bool HasValidConfiguration()
```

# ### Return Value
True if a valid fabrication configuration has been set for the project.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace